{
    "url": "https://firebase.google.com/docs/admin/setup#linux-or-macos",
    "section_title": "Introduction / Content Before First Heading",
    "level": 0,
    "content": "Check out the latest news from Firebase at Cloud Next 2025. Learn more. Firebase Documentation Admin SDK Fundamentals Send feedback Add the Firebase Admin SDK to your server Stay organized with collections Save and categorize content based on your preferences. The\nAdmin SDK\nis a set of server libraries that lets you interact with\nFirebase from privileged environments to perform actions like: Perform queries and mutations on a\nFirebase Data Connect\nservice for\nbulk data management and other operations with full admin privileges. Read and write\nRealtime Database\ndata with full admin privileges. Programmatically send\nFirebase Cloud Messaging\nmessages using a simple,\nalternative approach to the\nFirebase Cloud Messaging\nserver protocols. Generate and verify Firebase auth tokens. Access\nGoogle Cloud\nresources like\nCloud Storage\nbuckets and\nCloud Firestore\ndatabases associated with your Firebase projects. Create your own simplified admin console to do things like look up user data\nor change a user's email address for authentication. If you are interested in using the Node.js SDK as a client for end-user access\n(for example, in a Node.js desktop or IoT application), as opposed to admin\naccess from a privileged environment (like a server), you should instead follow\nthe\ninstructions for setting up the client JavaScript SDK\n. Here is a feature matrix showing what Firebase features are supported in each\nlanguage: Feature Node.js Java Python Go C# Custom Token Minting ID Token Verification User Management Control Access With Custom Claims Refresh Token Revocation Import Users Session Cookie Management Generating Email Action Links Managing SAML/OIDC provider configurations Multi-tenancy support Firebase Data Connect Realtime Database * Firebase Cloud Messaging FCM\nMulticast Manage\nFCM\nTopic Subscriptions Cloud Storage Cloud Firestore Enqueue functions with Cloud Tasks Project Management Security Rules ML Model Management Firebase Remote Config Firebase App Check Firebase Extensions To learn more about\nAdmin SDK\nintegration for these uses, see the corresponding\nRealtime Database\n,\nFCM\n,\nAuthentication\n,\nRemote Config\n,\nand\nCloud Storage\ndocumentation.\nThe rest of this page focuses on basic setup for the\nAdmin SDK\n."
}